create table board(
	id int auto_increment primary key,
    title varchar(100),
    pname varchar(100),
    pw varchar(100),
    upfile varchar(100),
    content varchar(9999),
    reg_date timestamp,
    cnt int,
    seq int,
    lev int,
    gid int
    
);

insert into board(id,title,pname, pw, content, reg_date, cnt, seq, lev, gid)
values
(0,'영글이에요','헤헤','1111','영글내용','2023-06-06',0,0,0,0),
(1,'첫글이에요','승우','1111','첫글내용','2023-05-05',0,0,0,1),
(2,'두번째글이에요','승우','1111','두번째글내용','2023-05-05',0,0,0,2),
(3,'세번쨔째글이에요','승우','1111','삼삼','2023-05-05',0,0,0,3),
(4,'네번째커피맛있네요','승우','1111','양은적네','2023-05-05',0,0,0,4),
(5,'다섯번째타코도요','승우','1111','비싸긴해','2023-05-05',0,0,0,5),
(6,'영글이에요','헤헤','1111','영글내용','2023-06-06',0,0,0,6),
(7,'첫글이에요','승우','1111','첫글내용','2023-05-05',0,0,0,7),
(8,'두번째글이에요','승우','1111','두번째글내용','2023-05-05',0,0,0,8),
(9,'세번쨔째글이에요','승우','1111','삼삼','2023-05-05',0,0,0,9),

(10,'영글이에요','헤헤','1111','영글내용','2023-06-06',0,0,0,10),
(11,'첫글이에요','승우','1111','첫글내용','2023-05-05',0,0,0,11),
(12,'두번째글이에요','승우','1111','두번째글내용','2023-05-05',0,0,0,12),
(13,'세번쨔째글이에요','승우','1111','삼삼','2023-05-05',0,0,0,13),
(14,'네번째커피맛있네요','승우','1111','양은적네','2023-05-05',0,0,0,14),
(15,'다섯번째타코도요','승우','1111','비싸긴해','2023-05-05',0,0,0,15),
(16,'영글이에요','헤헤','1111','영글내용','2023-06-06',0,0,0,16),
(17,'첫글이에요','승우','1111','첫글내용','2023-05-05',0,0,0,17),
(18,'두번째글이에요','승우','1111','두번째글내용','2023-05-05',0,0,0,18),
(19,'세번쨔째글이에요','승우','1111','삼삼','2023-05-05',0,0,0,19),

(20,'영글이에요','헤헤','1111','영글내용','2023-06-06',0,0,0,20),
(21,'첫글이에요','승우','1111','첫글내용','2023-05-05',0,0,0,21),
(22,'두번째글이에요','승우','1111','두번째글내용','2023-05-05',0,0,0,22),
(23,'세번쨔째글이에요','승우','1111','삼삼','2023-05-05',0,0,0,3),
(24,'네번째커피맛있네요','승우','1111','양은적네','2023-05-05',0,0,0,24),
(25,'다섯번째타코도요','승우','1111','비싸긴해','2023-05-05',0,0,0,25),
(26,'영글이에요','헤헤','1111','영글내용','2023-06-06',0,0,0,26),
(27,'첫글이에요','승우','1111','첫글내용','2023-05-05',0,0,0,27),
(28,'두번째글이에요','승우','1111','두번째글내용','2023-05-05',0,0,0,28),
(29,'세번쨔째글이에요','승우','1111','삼삼','2023-05-05',0,0,0,29),

(30,'영글이에요','헤헤','1111','영글내용','2023-06-06',0,0,0,30),
(31,'첫글이에요','승우','1111','첫글내용','2023-05-05',0,0,0,31),
(32,'두번째글이에요','승우','1111','두번째글내용','2023-05-05',0,0,0,32),
(33,'세번쨔째글이에요','승우','1111','삼삼','2023-05-05',0,0,0,33),
(34,'네번째커피맛있네요','승우','1111','양은적네','2023-05-05',0,0,0,34),
(35,'다섯번째타코도요','승우','1111','비싸긴해','2023-05-05',0,0,0,35),
(36,'영글이에요','헤헤','1111','영글내용','2023-06-06',0,0,0,36),
(37,'첫글이에요','승우','1111','첫글내용','2023-05-05',0,0,0,37),
(38,'두번째글이에요','승우','1111','두번째글내용','2023-05-05',0,0,0,38),
(39,'세번쨔째글이에요','승우','1111','삼삼','2023-05-05',0,0,0,39);


select * from board order by gid desc, seq;

update board set gid = 5 where id =5;

drop table board;


-- 갤러리 시작
create table gallery(
	id int auto_increment primary key,
    title varchar(100),
    pname varchar(100),
    pw varchar(100),
    upfile varchar(100),
    content varchar(9999),
    reg_date timestamp
);

select * from gallery;
drop table gallery;
INSERT INTO gallery (title, pname, pw, upfile, content, reg_date)
VALUES
  ('첫글', '일승우', '1111', 'apple.jpg', '스티븐좝스', '2023-08-07'),
  ('두글', '이승우', '1111', '1.jpg', '스티븐좝스', '2023-08-07'),
  ('세글', '삼승우', '1111', 'bg5.jpg', '스티븐좝스', '2023-08-07'),
  ('네글', '사승우', '1111', 'cup-1.png', '스티븐좝스', '2023-08-07'),
  ('다섯글', '우승우', '1111', 'guitar-bg.jpg', '스티븐좝스', '2023-08-07');